emb4fun/tinysid-ecc-ea1062/source/common/library/tal_ea1062/cpu/nxp/imxrt1060/sdk/v270/drivers/fsl_enet.c
    /* Enable a multicast group address. */
    configVal = 1U;
    configVal = configVal << ((crc >> 0x1AU) & 0x1FU);

    if (0U == ((crc >> 0x1FU) & 1U))
    {
        base->GALR |= configVal;
    }
    else
    {
        base->GAUR |= configVal;
    }
}

/*!
 * brief Moves the ENET device from a multicast group.
 *
 * param base  ENET peripheral base address.
 * param address The six-byte multicast group address which is provided by application.
 */
void ENET_LeaveMulticastGroup(ENET_Type *base, uint8_t *address)
{
    assert(address != NULL);

    uint32_t crc       = 0xFFFFFFFFU;
    uint32_t count1    = 0;
    uint32_t count2    = 0;
    uint32_t configVal = 0;

    /* Calculates the CRC-32 polynomial on the multicast group address. */
    for (count1 = 0; count1 < ENET_FRAME_MACLEN; count1++)
    {
        uint8_t c = address[count1];
        for (count2 = 0; count2 < 0x08U; count2++)
        {
            if (0U != ((c ^ crc) & 1U))
            {
                crc >>= 1U;
                c >>= 1U;
                crc ^= 0xEDB88320U;
            }
            else
            {
                crc >>= 1U;
                c >>= 1U;
            }
        }
    }

    /* Set the hash table. */
    configVal = 1U;
    configVal = ~(configVal << ((crc >> 0x1AU) & 0x1FU));
    if (0U == ((crc >> 0x1FU) & 1U))
    {
        base->GALR &= configVal;
    }
    else
    {
        base->GAUR &= configVal;
    }
}

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
/*!
 * brief Gets the ENET transmit frame statistics after the data send for single ring.
 *
 * This interface gets the error statistics of the transmit frame.
 * Because the error information is reported by the uDMA after the data delivery, this interface
 * should be called after the data transmit API. It is recommended to call this function on
 * transmit interrupt handler. After calling the ENET_SendFrame, the
 * transmit interrupt notifies the transmit completion.
 *
 * param handle The PTP handler pointer. This is the same handler pointer used in the ENET_Init.
 * param eErrorStatic The error statistics structure pointer.
 * return The execute status.
 */
status_t ENET_GetTxErrAfterSendFrame(enet_handle_t *handle, enet_data_error_stats_t *eErrorStatic)
{
    assert(handle != NULL);
    assert(eErrorStatic != NULL);

    uint16_t control    = 0;
    uint16_t controlExt = 0;
    status_t result     = kStatus_Success;
    bool isReturn       = false;

    do
    {
        /* Get the current dirty transmit buffer descriptor. */
        control    = handle->txBdDirtyStatic[0]->control;
        controlExt = handle->txBdDirtyStatic[0]->controlExtend0;

        /* Get the control status data, If the buffer descriptor has not been processed break out. */
        if (0U != (control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            result   = kStatus_ENET_TxFrameBusy;
            isReturn = true;
            break;
        }
        else
        {
            /* Increase the transmit dirty static pointer. */
            if (0U != (handle->txBdDirtyStatic[0]->control & ENET_BUFFDESCRIPTOR_TX_WRAP_MASK))
            {
                handle->txBdDirtyStatic[0] = handle->txBdBase[0];
            }
            else
            {
                handle->txBdDirtyStatic[0]++;
            }

            /* If the transmit buffer descriptor is ready and the last buffer descriptor, store packet statistic. */
            if (0U != (control & ENET_BUFFDESCRIPTOR_TX_LAST_MASK))
            {
                if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_ERR_MASK))
                {
                    /* Transmit error. */
                    eErrorStatic->statsTxErr++;
                }
                if (controlExt & ENET_BUFFDESCRIPTOR_TX_EXCCOLLISIONERR_MASK)
                {
                    /* Transmit excess collision error. */
                    eErrorStatic->statsTxExcessCollisionErr++;
                }
                if (controlExt & ENET_BUFFDESCRIPTOR_TX_LATECOLLISIONERR_MASK)
                {
                    /* Transmit late collision error. */
                    eErrorStatic->statsTxLateCollisionErr++;
                }
                if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_UNDERFLOWERR_MASK))
                {
                    /* Transmit under flow error. */
                    eErrorStatic->statsTxUnderFlowErr++;
                }
                if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_OVERFLOWERR_MASK))
                {
                    /* Transmit over flow error. */
                    eErrorStatic->statsTxOverFlowErr++;
                }
                isReturn = true;
                break;
            }
        }

    } while (handle->txBdDirtyStatic[0] != handle->txBdCurrent[0]);

    if (isReturn == false)
    {
        result = kStatus_ENET_TxFrameFail;
    }
    return result;
}

#if FSL_FEATURE_ENET_QUEUE > 1
/*!
 * brief Gets the ENET transmit frame statistics after the data send for extended multi-ring.
 *
 * This interface gets the error statistics of the transmit frame.
 * Because the error information is reported by the uDMA after the data delivery, this interface
 * should be called after the data transmit API and shall be called by transmit interrupt handler.
 * After calling the ENET_SendFrame, the transmit interrupt notifies the transmit completion.
 *
 * param handle The PTP handler pointer. This is the same handler pointer used in the ENET_Init.
 * param eErrorStatic The error statistics structure pointer.
 * param ringId The ring index.
 * return The execute status.
 */
status_t ENET_GetTxErrAfterSendFrameMultiRing(enet_handle_t *handle,
                                              enet_data_error_stats_t *eErrorStatic,
                                              uint32_t ringId)
{
    assert(handle != NULL);
    assert(eErrorStatic != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);

    uint16_t control    = 0;
    uint16_t controlExt = 0;
    status_t result     = kStatus_Success;
    bool isReturn       = false;

    do
    {
        /* Get the current dirty transmit buffer descriptor. */
        control    = handle->txBdDirtyStatic[ringId]->control;
        controlExt = handle->txBdDirtyStatic[ringId]->controlExtend0;
        /* Get the control status data, If the buffer descriptor has not been processed break out. */
        if (0U != (control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            isReturn = true;
            result   = kStatus_ENET_TxFrameBusy;
            break;
        }
        /* Increase the transmit dirty static pointer. */
        if (0U != (handle->txBdDirtyStatic[ringId]->control & ENET_BUFFDESCRIPTOR_TX_WRAP_MASK))
        {
            handle->txBdDirtyStatic[ringId] = handle->txBdBase[ringId];
        }
        else
        {
            handle->txBdDirtyStatic[ringId]++;
        }

        /* If the transmit buffer descriptor is ready and the last buffer descriptor, store packet statistic. */
        if (0U != (control & ENET_BUFFDESCRIPTOR_TX_LAST_MASK))
        {
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_ERR_MASK))
            {
                /* Transmit error. */
                eErrorStatic->statsTxErr++;
            }
            if (controlExt & ENET_BUFFDESCRIPTOR_TX_EXCCOLLISIONERR_MASK)
            {
                /* Transmit excess collision error. */
                eErrorStatic->statsTxExcessCollisionErr++;
            }
            if (controlExt & ENET_BUFFDESCRIPTOR_TX_LATECOLLISIONERR_MASK)
            {
                /* Transmit late collision error. */
                eErrorStatic->statsTxLateCollisionErr++;
            }
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_UNDERFLOWERR_MASK))
            {
                /* Transmit under flow error. */
                eErrorStatic->statsTxUnderFlowErr++;
            }
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_TX_OVERFLOWERR_MASK))
            {
                /* Transmit over flow error. */
                eErrorStatic->statsTxOverFlowErr++;
            }
            isReturn = true;
            break;
        }

    } while (handle->txBdDirtyStatic[ringId] != handle->txBdCurrent[ringId]);

    if (isReturn == false)
    {
        result = kStatus_ENET_TxFrameFail;
    }

    return result;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */

static bool ENET_Ptp1588ParseFrame(const uint8_t *data, enet_ptp_time_data_t *ptpTsData, bool isFastEnabled)
{
    assert(data != NULL);
    if (!isFastEnabled)
    {
        assert(ptpTsData != NULL);
    }

    bool isPtpMsg         = false;
    const uint8_t *buffer = data;
    uint16_t ptpType;

